###   Creating dataframes using different methods

In [1]:
import pandas as pd
import numpy as np

#### Finding data type

In [5]:
myself=pd.Series(['jimin','jungkook','namjoon','jhope','jin','suga','tae'])
print(myself.dtype)

object

#### Converting to List

In [6]:
print(myself.tolist())

['jimin', 'jungkook', 'namjoon', 'jhope', 'jin', 'suga', 'tae']

#### Empty data frame

In [7]:
mydf=pd.DataFrame()
print(mydf)

Empty DataFrame
Columns: []
Index: []

####  1. Dataframe using list of lists

In [9]:
IQlevel=[['pramish',9.9],['anjana',8.9],['jibin',7.5],['rahul',6.3],['abhi',7],['shanfeer',5],['soorya',2],['anuja',10],['gopu',1.5],['revathy',6]]
mydf=pd.DataFrame(IQlevel,columns=['Person','IQ'])
mydf

     Person    IQ
0   pramish   9.9
1    anjana   8.9
2     jibin   7.5
3     rahul   6.3
4      abhi   7.0
5  shanfeer   5.0
6    soorya   2.0
7     anuja  10.0
8      gopu   1.5
9   revathy   6.0

#### 2.Dataframe using dictionaries

In [14]:
IQlevel={'people':["pramish","anjana","jibin","rahul","abhi","shanfeer","soorya","anuja","gopu","revathy"],   
'IQ':[9.9,8.9,7.5,6.3,7,5,2,10,1.5,6],  
}
mydf=pd.DataFrame(IQlevel) 
mydf

     people    IQ
0   pramish   9.9
1    anjana   8.9
2     jibin   7.5
3     rahul   6.3
4      abhi   7.0
5  shanfeer   5.0
6    soorya   2.0
7     anuja  10.0
8      gopu   1.5
9   revathy   6.0

#### 3. Dataframe using list of dictionaries

In [17]:
IQlevel=[
{'people':'pramish', 'IQ':9.9},   
{'people':'anjana', 'IQ':8.9},  
{'people':'jibin', 'IQ':7.5},  
{'people':'rahul', 'IQ':6.3},  
{'people':'abhi', 'IQ':7},
{'people':'shanfeer', 'IQ':5},   
{'people':'soorya', 'IQ':2},
{'people':'anuja', 'IQ':10},
{'people':'gopu', 'IQ':1.5},
{'people':'revathy', 'IQ':6},
]
mydf=pd.DataFrame(IQlevel)
mydf

     people    IQ
0   pramish   9.9
1    anjana   8.9
2     jibin   7.5
3     rahul   6.3
4      abhi   7.0
5  shanfeer   5.0
6    soorya   2.0
7     anuja  10.0
8      gopu   1.5
9   revathy   6.0

#### 4. Dataframe using list of dictionaries  with null items

In [20]:
IQlevel=[
{'people':'pramish'},   
{'people':'anjana', 'IQ':8.9},  
{'people':'jibin', 'IQ':7.5},  
{'people':'rahul', 'IQ':6.3},  
{'people':'abhi', 'IQ':7},
{'people':'shanfeer'},   
{'people':'soorya', 'IQ':2},
{'people':'anuja'},
{'people':'gopu', 'IQ':1.5},
{'people':'revathy', 'IQ':6},    
]
mydf=pd.DataFrame(IQlevel)
mydf

     people   IQ
0   pramish  NaN
1    anjana  8.9
2     jibin  7.5
3     rahul  6.3
4      abhi  7.0
5  shanfeer  NaN
6    soorya  2.0
7     anuja  NaN
8      gopu  1.5
9   revathy  6.0